In [1]:
import pandas as pd

In [2]:
country = pd.read_csv('Cars_Country.csv')
car = pd.read_csv('Cars_Data')
Multi = pd.read_csv('Cars_Multi.csv')
Price = pd.read_csv('Cars_Price.csv')

In [3]:
country

   origin country
0       1     USA
1       2  Europe
2       3   Japan

In [4]:
car

Empty DataFrame
Columns: [{"query_text":"SELECT\r\n\r\ncar_name AS `Car`, \r\nCONCAT(\"19\", model) AS `Model Year`, \r\ncountry AS `Country`, \r\nmpg AS `Mileage`, \r\ncylinders AS `No. of Cylinders`, \r\ndisplacement AS `Displacement`, \r\nhorsepower AS `HP`, \r\nweight AS `Weight`, \r\nacceleration AS `Acceleration`, \r\nprice AS `Price`\r\n\r\nFROM\r\n(\r\n    SELECT x.*,  y.country\r\n    FROM\r\n    (\r\n        SELECT m.*,  p.price\r\n        FROM \r\n        Cars_Multi m INNER JOIN\r\n        Cars_Price p ON\r\n        m.id = p.id\r\n    ) x LEFT JOIN\r\n    Cars_Country y ON\r\n    x.origin = y.origin\r\n) AS `Consolidate Table`", query_lang:"SQL", metadata:[{"name":"Car", table:"Consolidate Table", dataset:"cars-data", agent:"dataman-udit", description:"Name of the car", type:"http://www.w3.org/2001/XMLSchema#string", sparqlVariableName:"?v_0"}, {"name":"Model Year", description:"CONCAT(\"19\",  model)", type:"http://www.w3.org/2001/XMLSchema#string".1, sparqlVariableName:"?v_1"}, {"name":"Country", table:"Consolidate Table".1, dataset:"cars-data".1, agent:"dataman-udit".1, description:"Country name", type:"http://www.w3.org/2001/XMLSchema#string".2, sparqlVariableName:"?v_2"}, {"name":"Mileage", table:"Consolidate Table".2, dataset:"cars-data".2, agent:"dataman-udit".2, description:"Mileage of the car in miles per gallon ", type:"http://www.w3.org/2001/XMLSchema#decimal", sparqlVariableName:"?v_3"}, {"name":"No. of Cylinders", table:"Consolidate Table".3, dataset:"cars-data".3, agent:"dataman-udit".3, description:"No. of cylinders present in the car", type:"http://www.w3.org/2001/XMLSchema#integer", sparqlVariableName:"?v_4"}, {"name":"Displacement", table:"Consolidate Table".4, dataset:"cars-data".4, agent:"dataman-udit".4, description:"Engine displacement in cubic mm (Swept volume of pistons inside the cylinders. )", type:"http://www.w3.org/2001/XMLSchema#decimal".1, sparqlVariableName:"?v_5"}, {"name":"HP", table:"Consolidate Table".5, dataset:"cars-data".5, agent:"dataman-udit".5, description:"Horse-Power associated with the car", type:"http://www.w3.org/2001/XMLSchema#integer".1, sparqlVariableName:"?v_6"}, {"name":"Weight", table:"Consolidate Table".6, dataset:"cars-data".6, agent:"dataman-udit".6, description:"Weight of the car (in lbs)", type:"http://www.w3.org/2001/XMLSchema#integer".2, sparqlVariableName:"?v_7"}, {"name":"Acceleration", table:"Consolidate Table".7, dataset:"cars-data".7, agent:"dataman-udit".7, description:"Acceleration of the car in miles per squared hour", type:"http://www.w3.org/2001/XMLSchema#decimal".2, sparqlVariableName:"?v_8"}, {"name":"Price", table:"Consolidate Table".8, dataset:"cars-data".8, agent:"dataman-udit".8, description:"Price of the car in USD", type:"http://www.w3.org/2001/XMLSchema#decimal".3, sparqlVariableName:"?v_9"}], datasetVersions:["dataman-udit/cars-data/6d7d49ea-edde-4825-838b-4e34b3bd31b7"], head:{"vars":["v_0", v_1, v_2, v_3, v_4, v_5, v_6, v_7, v_8, v_9]}, results:{"bindings":[{"v_0":{"type":"literal", value:"chevrolet chevelle malibu"}, v_1:{"type":"literal", value:"1970"}, v_2:{"type":"literal", value:"USA"}, v_3:{"type":"literal", ...]
Index: []

[0 rows x 10821 columns]

In [8]:
car = pd.read_fwf('Cars_Data')

In [10]:
Price

      ID        price
0      1  25561.59078
1      2  24221.42273
2      3  27240.84373
3      4  33684.96888
4      5  20000.00000
..   ...          ...
393  394  13432.50000
394  395  37000.00000
395  396  47800.00000
396  397  46000.00000
397  398   9000.00000

[398 rows x 2 columns]